{
  "hero_section": {
    "tagline": "SMART AUTOMATION POWERED BY AI APPS",
    "title_part1": "Transforming Workflows into",
    "title_part2": "Seamless Intelligent Experiences",
    "description": "Hi! I'm Yana Shurpik, a full-stack Developer from Poland",
    "button_text": "See my work"
  },
  "about_section": {
    "flexible_communication": "I'm very flexible with time zone communications",
    "client_collaboration": "I prioritize client collaboration, fostering open communication",
    "js_animation_library": "Currently building an AI Chat Bot"
  },
  "projects_section": {
    "title": "A small selection of recent projects",
    "project1": {
      "title": "Amazon Competitors Reporting",
      "description": "This app conducts deep competitor research and uses AI to identify key differentiators, offering actionable insights for improvement. It also analyzes media assets and generates high-quality, AI-crafted product visuals that can serve as creative references or ready-to-use marketing materials.",
      "live_site_text": "Check Live Site"
    },
    "project2": {
      "title": "Intelligent Samples - MrSampler",
      "description": "This desktop app uses AI to analyze audio files and automatically tag them by genre, mood, instruments, and energy level. It helps producers and sound designers organize and discover their sounds instantly, turning chaotic sample folders into a smart, searchable audio library.",
      "live_site_text": "Check Live Site"
    },
    "project3": {
      "title": "Portfolio Website",
      "description": "This portfolio website highlights key business strengths while seamlessly blending AI-generated content with modern design. It organizes visual styles and animations to create an engaging, intelligent showcase of creativity and technology.",
      "live_site_text": "Check Live Site"
    },
    "project4": {
      "title": "API Key Management System",
      "description": "A modern API key management system built with Next.js and Supabase, featuring secure key generation, usage tracking, and role-based access control.",
      "live_site_text": "Check Live Site"
    }
  },
  "testimonials_section": {
    "title": "Kind words from satisfied clients",
    "testimonial1": {
      "text": "Working with Yana was an absolute pleasure. She combined creativity with AI to build a smart audio library that analyzes and tags my samples automatically. The app makes it super easy to find the right sounds fast - it’s a huge time saver in my music production workflow.",
      "author": "Hoa Nguyen",
      "role": "Music Producer"
    },
    "testimonial2": {
      "text": "Yana built a competitor analysis platform for my e-commerce business that saved me countless hours of manual research. Every idea I shared was understood and implemented thoughtfully — she’s very agile, responsive, and always one step ahead in improving the product. Great work!",
      "author": "Kim Cruickshanks",
      "role": "Founder & CEO of Cooking Gift Set Co"
    },
    "testimonial3": {
      "text": "Yana's proactive, detail-oriented, and great to work with — always finding smart ways to make testing smoother. She was a key part of our QA team. She built solid automation with Cypress and TypeScript, quickly improving our test coverage and release speed.",
      "author": "Aleksandra Mocek",
      "role": "Project Manager at Avenga"
    }
  },
  "experience_section": {
    "title": "My work experience",
    "job1": {
      "title": "QA Automation Engineer Intern - Andersen",
      "description": "Automated quality assurance processes for a CRM web platform."
    },
    "job2": {
      "title": "QA Automation Engineer Mid - Clearcode",
      "description": "Assisted in the development of an ad-tech platforms, enhancing quality and user experience."
    },
    "job3": {
      "title": "Team Lead QA Automation Engineer - Avenga",
      "description": "Led the e2e automation of a ad-tech platform, from initial concept to deployment."
    },
    "job4": {
      "title": "Freelance Web Developer",
      "description": "AI consulting, developing and deploying websites and apps for e-commerce, ad-tech and finance."
    }
  },
  "approach_section": {
    "title": "My approach",
    "phase1": {
      "front_title": "Phase 1",
      "front_main_title": "Discovery & Planning",
      "back_small_title": "Phase 1",
      "back_main_title": "Discovery & Planning",
      "back_description": "We start by discussing your vision and goals. I'll create a detailed project plan and timeline to ensure we're aligned every step of the way."
    },
    "phase2": {
      "front_title": "Phase 2",
      "front_main_title": "Development & Progress Update",
      "back_small_title": "Phase 2",
      "back_main_title": "Development & Progress Update",
      "back_description": "Once we agree on the plan, I cue my lofi playlist and dive into coding. From initial sketches to polished code, I keep you updated every step of the way."
    },
    "phase3": {
      "front_title": "Phase 3",
      "front_main_title": "Deployment & Review",
      "back_small_title": "Phase 3",
      "back_main_title": "Deployment & Review",
      "back_description": "After thorough testing, I'll deploy the project. We'll review the final product together to ensure it meets your expectations and discuss any final tweaks."
    }
  },
  "call_to_action_section": {
    "title": "Ready to take your digital presence to the next level?",
    "subtitle": "Reach out to me today and let's discuss how I can help you achieve your goals."
  },
  "footer": {
    "copyright": "Copyright ©2024 Yana Shurpik"
  }
}
